damienmaguire/Stm32-vcu/src/stm32_vcu.cpp
/*
 * This file is part of the ZombieVerter project.
 *
 * Copyright (C) 2024 Tom de Bree <tom@voltinflux.com>
 * Copyright (C) 2010 Johannes Huebner <contact@johanneshuebner.com>
 * Copyright (C) 2010 Edward Cheeseman <cheesemanedward@gmail.com>
 * Copyright (C) 2009 Uwe Hermann <uwe@hermann-uwe.de>
 * Copyright (C) 2019-2022 Damien Maguire <info@evbmw.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "BMW_E31.h"
#include "BMW_E39.h"
#include "BMW_E65.h"
#include "CANSPI.h"
#include "CPC.h"
#include "Can_OBD2.h"
#include "Can_OI.h"
#include "Can_VAG.h"
#include "E65_Lever.h"
#include "ElconCharger.h"
#include "ElconDCDC.h"
#include "F30_Lever.h"
#include "Foccci.h"
#include "GS450H.h"
#include "InverterACP.h"
#include "InverterVESC.h"
#include "JLR_G1.h"
#include "JLR_G2.h"
#include "MGCoolantHeater.h"
#include "MGgen2V2Lcharger.h"
#include "Maintainer12V.h"
#include "NissanPDM.h"
#include "OutlanderCanHeater.h"
#include "OutlanderCompressor.h"
#include "OutlanderHeartBeat.h"
#include "PWMHeater.h"
#include "TeslaDCDC.h"
#include "VWAirHeater.h"
#include "VWCoolantHeater.h"
#include "V_Classic.h"
#include "WebastoHVH.h"
#include "amperacharger.h"
#include "amperaheater.h"
#include "anain.h"
#include "bms.h"
#include "bmw_sbox.h"
#include "canmap.h"
#include "cansdo.h"
#include "chademo.h"
#include "chargerhw.h"
#include "chargerint.h"
#include "compressor.h"
#include "daisychainbms.h"
#include "dcdc.h"
#include "digio.h"
#include "digipot.h"
#include "errormessage.h"
#include "extCharger.h"
#include "heater.h"
#include "hwdefs.h"
#include "hwinit.h"
#include "i3LIM.h"
#include "inverter.h"
#include "iomatrix.h"
#include "isa_shunt.h"
#include "kangoobms.h"
#include "leafbms.h"
#include "leafinv.h"
#include "linbus.h"
#include "my_math.h"
#include "notused.h"
#include "oibms.h"
#include "outlanderCharger.h"
#include "outlanderinverter.h"
#include "param_save.h"
#include "params.h"
#include "preheater.h"
#include "printf.h"
#include "ptocontrol.h"
#include "rearoutlanderinverter.h"
#include "sdocommands.h"
#include "shifter.h"
#include "simpbms.h"
#include "stm32_can.h"
#include "stm32scheduler.h"
#include "stwmbms.h"
#include "subaruvehicle.h"
#include "temp_meas.h"
#include "terminal.h"
#include "terminalcommands.h"
#include "teslaCharger.h"
#include "throttle.h"
#include "utils.h"
#include "vag_sbox.h"
#include "vehicle.h"
#include <libopencm3/stm32/can.h>
#include <libopencm3/stm32/exti.h>
#include <libopencm3/stm32/iwdg.h>
#include <libopencm3/stm32/rtc.h>
#include <libopencm3/stm32/spi.h>
#include <libopencm3/stm32/timer.h>
#include <libopencm3/stm32/usart.h>
#include <stdint.h>

#define PRECHARGE_TIMEOUT 5 // 5s

#define PRINT_JSON 0

extern "C" void __cxa_pure_virtual() {
  while (1)
    ;
}

static Stm32Scheduler *scheduler;
static bool chargeMode = false;
static bool chargeModeDC = false;
static bool ChgLck = false;
static CanHardware *canInterface[3];
static CanMap *canMap;
static CanSdo *canSdo;
static ChargeModes targetCharger;
static ChargeInterfaces targetChgint;
static uint8_t ChgSet; // Temp variable storing Param::Chgctrl. 0=enable,
                       // 1=disable, 2=timer.
static bool RunChg;
static uint8_t ChgHrs_tmp;
static uint8_t ChgMins_tmp;
static uint16_t ChgDur_tmp;
static uint32_t ChgTicks = 0, ChgTicks_1Min = 0;
static bool StartSig = false;
static bool ACrequest = false;
static bool initbyStart = false;
static bool initbyCharge = false;
static bool OutlanderCAN = false;
static bool ExtHVreq = false;
static bool CheckHVIL = 0;
static bool HVILok = 0;

static volatile unsigned days = 0, hours = 0, minutes = 0, seconds = 0,
                         alarm = 0; // != 0 when alarm is pending

static uint16_t rlyDly = 25;
static uint16_t prechargeMinTime = 100;

// Instantiate Classes
static BMW_E31 e31Vehicle;
static BMW_E65 e65Vehicle;
static BMW_E39 e39Vehicle;
static Can_VAG vagVehicle;
static SubaruVehicle subaruVehicle;
static GS450HClass gs450Inverter;
static LeafINV leafInv;
static NissanPDM chargerPDM;
static teslaCharger ChargerTesla;
static ElconCharger ChargerElcon;
static notused UnUsed;
static extCharger chgdigi;
static amperaCharger ampChg;
static outlanderCharger outChg;
static MGgen2V2Lcharger MGgen2v2l;
static FCChademo chademoFC;
static i3LIMClass LIMFC;
static CPCClass CPCcan;
static FoccciClass Focccican;
static Can_OI openInv;
static InverterACP inverterAcp;
static InverterVESC inverterVESC;
static OutlanderInverter outlanderInv;
// Second inverter slot (CAN-based drivers only, see UpdateInv2())
static Can_OI openInv2;
static InverterACP inverterAcp2;
static InverterVESC inverterVESC2;
static LeafINV leafInv2;
static OutlanderInverter outlanderInv2;
static RearOutlanderInverter rearoutlanderInv2;
static AmperaHeater amperaHeater;
static WebastoHVH webastoHeater;
static OutlanderCanHeater outlanderCanHeater;
static F30_Lever F30GearLever;
static E65_Lever E65GearLever;
static JLR_G1 JLRG1shift;
static JLR_G2 JLRG2shift;
static vwCoolantHeater heaterCoolantVW;
static mgCoolantHeater heaterCoolantMG;
static vwAirHeater heaterAirVW;
static V_Classic classVehicle;
static Inverter *selectedInverter = &UnUsed;
static Inverter *selectedInverter2 = &UnUsed;
static Vehicle *selectedVehicle = &UnUsed;
static Heater *selectedHeater = &UnUsed;
static Chargerhw *selectedCharger = &chargerPDM;
static Chargerint *selectedChargeInt = &UnUsed;
static Shifter *selectedShifter = &UnUsed;
static SimpBMS BMSsimp;
static OIBMS flyingAdcBms;
static LeafBMS BMSleaf;
static DaisychainBMS BMSdaisychain;
static KangooBMS BMSRenaultKangoo33;
static STWmBMS stwBms;
static DCDC DCDCnone;
static TeslaDCDC DCDCTesla;
static ElconDCDC ElconDC;
static BMS *selectedBMS = &UnUsed;
static DCDC *selectedDCDC = &DCDCnone;
static Can_OBD2 canOBD2;
static Shifter shifterNone;
static RearOutlanderInverter rearoutlanderInv;
static LinBus *lin;
static Preheater preheater;
static OutlanderCompressor outlanderCompressor;
static Compressor *selectedCompressor = &UnUsed;
static PWMHeater pwmHeater;
static Maintainer12V maintainer12V;
static PTOControl ptoControl;

