damienmaguire/Stm32-vcu/src/stm32_vcu.cpp
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static void Ms200Task(void) {
  int opmode = Param::GetInt(Param::opmode);

  selectedVehicle->Task200Ms();
  if (opmode == MOD_CHARGE)
    selectedCharger->Task200Ms();

  // in chademo , we do not want to run the 200ms task unless in dc charge mode
  if (targetChgint == ChargeInterfaces::Chademo && chargeModeDC)
    selectedChargeInt->Task200Ms();
  // In case of the LIM we want to send it all the time if lim in use
  if ((targetChgint == ChargeInterfaces::i3LIM) ||
      (targetChgint == ChargeInterfaces::Unused) ||
      (targetChgint == ChargeInterfaces::CPC) ||
      (targetChgint == ChargeInterfaces::Foccci))
    selectedChargeInt->Task200Ms();
  // and just to be thorough ...
  if (targetChgint == ChargeInterfaces::Unused)
    selectedChargeInt->Task200Ms();

  // if(opmode==MOD_CHARGE) utils::CpSpoofOutput;
  utils::CpSpoofOutput();

  Param::SetInt(Param::Day, days);
  Param::SetInt(Param::Hour, hours);
  Param::SetInt(Param::Min, minutes);
  Param::SetInt(Param::Sec, seconds);
  Param::SetInt(Param::uptime, rtc_get_counter_val());
  Param::SetInt(Param::ChgT, ChgDur_tmp);

  // Setting of RunChg - main okay to charge param

  if (ChgSet == 2 && !ChgLck) // if in timer mode and not locked out from a
                              // previous full charge.
  {
    if (opmode != MOD_CHARGE) {
      if ((ChgHrs_tmp == hours) && (ChgMins_tmp == minutes) &&
          (ChgDur_tmp != 0))
        RunChg = true; // if we arrive at set charge time and duration is non
                       // zero then initiate charge
      else
        RunChg = false;
    }

    if (opmode == MOD_CHARGE) {
      if (ChgTicks != 0) {
        ChgTicks--; // decrement charge timer ticks
        ChgTicks_1Min++;
      }

      if (ChgTicks == 0) {
        RunChg = false; // end charge if still charging once timer expires.
        ChgTicks = (GetInt(Param::Chg_Dur) * 300); // recharge the tick timer
      }

      if (ChgTicks_1Min == 300) {
        ChgTicks_1Min = 0;
        ChgDur_tmp--; // countdown minutes of charge time remaining.
      }
    }
  }
  if (ChgSet == 0 && !ChgLck)
    RunChg = true; // enable from webui if we are not locked out from an auto
                   // termination
  if (ChgSet == 1)
    RunChg = false; // disable from webui

  // Handle PP on the Charging port - Changes RunChg
  if (Param::GetInt(Param::GPA1Func) == IOMatrix::PILOT_PROX ||
      Param::GetInt(Param::GPA2Func) == IOMatrix::PILOT_PROX) {
    int ppThresh = Param::GetInt(Param::ppthresh);
    int ppValue = IOMatrix::GetAnaloguePin(IOMatrix::PILOT_PROX)->Get();
    Param::SetInt(Param::PPVal, ppValue);

    // If PP is at or below threshold and currently disabled and not already
    // finished
    if (ppValue <= ppThresh) {
      if (ChgSet == 1 && !ChgLck) {
        RunChg = true;
      }
      Param::SetInt(Param::PlugDet, 1);
    } else if (ppValue > ppThresh) {
      // even if timer was enabled, change to disabled, we've unplugged
      RunChg = false;
      Param::SetInt(Param::PlugDet, 0);
    }
  }
  // END Setting of RunChg - main okay to charge param

  // Check if we want to AC charge via charger
  if (selectedCharger->ControlCharge(RunChg, ACrequest) &&
      (opmode != MOD_RUN)) {
    chargeMode = true; // AC charge mode
    Param::SetInt(Param::chgtyp, AC);
  } else if (!chargeModeDC) {
    Param::SetInt(Param::chgtyp, OFF);
    chargeMode = false; // no charge mode
  }
  // end check

  ///////////////////////////////////////
  // Charge term logic for AC charge
  ///////////////////////////////////////
  /*
  if we are in charge mode and battV >= setpoint and power is <= termination
  setpoint Then we end charge.
  */
  if (opmode == MOD_CHARGE && !chargeModeDC) {
    if (Param::GetInt(Param::udc) >= Param::GetInt(Param::Voltspnt) &&
        Param::GetInt(Param::idc) <= Param::GetInt(Param::IdcTerm)) {
      RunChg = false; // end charge
      ChgLck = true;  // set charge lockout flag
    }

    if (selectedBMS->MaxChargeCurrent() ==
        0) // BMS can command an AC charge shutdown if its current limit is 0
    {
      RunChg = false; // end charge
      ChgLck = true;  // set charge lockout flag
    }
  }
  // End Charge Term Logic

  if (opmode == MOD_RUN) {
    ChgLck = false; // reset charge lockout flag when we drive off

    selectedCompressor->Task200Ms();

    // Brake Vac Sensor
    if (Param::GetInt(Param::GPA1Func) == IOMatrix::VAC_SENSOR ||
        Param::GetInt(Param::GPA2Func) == IOMatrix::VAC_SENSOR) {
      int brkVacThresh = Param::GetInt(Param::BrkVacThresh);
      int BrkVacHyst = Param::GetInt(Param::BrkVacHyst);

      int brkVacVal = IOMatrix::GetAnaloguePin(IOMatrix::VAC_SENSOR)->Get();
      Param::SetInt(Param::BrkVacVal, brkVacVal);

      // if brkVacThresh > BrkVacHyst then sensor reads higher with more vacuum
      // else other way round
      if (brkVacThresh > BrkVacHyst) {
        // enable pump
        if (brkVacVal > brkVacThresh) {
          IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Clear();
        } else if (brkVacVal < BrkVacHyst) {
          IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Set();
        }
      } else {
        // enable pump
        if (brkVacVal < brkVacThresh) {
          IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Clear();
        } else if (brkVacVal > BrkVacHyst) {
          IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Set();
        }
      }
    }
  } else {
    IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Clear();
  }

  maintainer12V.Task200Ms(opmode);
  preheater.Task200Ms(opmode, hours, minutes);
}

static void Ms100Task(void) {
  DigIo::led_out.Toggle();
  iwdg_reset();
  float cpuLoad = scheduler->GetCpuLoad() / 10.0f;
  Param::SetFloat(Param::cpuload, cpuLoad);
  Param::SetInt(Param::lasterr, ErrorMessage::GetLastError());
  int opmode = Param::GetInt(Param::opmode);
  utils::SelectDirection(selectedVehicle, selectedShifter);

