damienmaguire/Stm32-vcu/src/stm32_vcu.cpp
  if (Param::GetInt(Param::ShuntType) != 0) // Do not do any SOC calcs
  {
    utils::CalcSOC();
  }

  Param::SetInt(Param::cruisestt, selectedVehicle->GetCruiseState());
  Param::SetFloat(Param::FrontRearBal, selectedVehicle->GetFrontRearBalance());

  utils::ProcessCruiseControlButtons();

  selectedInverter->Task100Ms();
  selectedInverter2->Task100Ms();
  selectedVehicle->Task100Ms();
  selectedCharger->Task100Ms();
  selectedBMS->Task100Ms();
  selectedDCDC->Task100Ms();
  selectedShifter->Task100Ms();
  selectedHeater->Task100Ms();
  canMap->SendAll();
  canSdo->TriggerTimeout(100);

  if (OutlanderCAN == true) {
    OutlanderHeartBeat::Task100Ms();
  }

  if (opmode == MOD_RUN) // Just Comms
  {
    selectedCompressor->Task100Ms();
  }

  // Setting reverse light
  if (Param::GetInt(Param::dir) < 0) {
    IOMatrix::GetPin(IOMatrix::REVERSELIGHT)->Set();
  } else {
    IOMatrix::GetPin(IOMatrix::REVERSELIGHT)->Clear();
  }

  // Setting Run light
  if (opmode == MOD_RUN) {
    IOMatrix::GetPin(IOMatrix::RUNINDICATION)->Set();
  } else {
    IOMatrix::GetPin(IOMatrix::RUNINDICATION)->Clear();
  }
  // end lights

  Param::SetFloat(
      Param::tmphs,
      selectedInverter
          ->GetInverterTemperature()); // send inverter temp to web interface
  Param::SetFloat(
      Param::tmpm,
      selectedInverter
          ->GetMotorTemperature()); // send motor temp to web interface
  Param::SetFloat(
      Param::InvStat,
      selectedInverter
          ->GetInverterState()); // update inverter status on web interface
  Param::SetFloat(
      Param::INVudc,
      selectedInverter->GetInverterVoltage()); // display inverter derived dc
                                               // link voltage on web interface

  Param::SetFloat(Param::tmphs2, selectedInverter2->GetInverterTemperature());
  Param::SetFloat(Param::tmpm2, selectedInverter2->GetMotorTemperature());
  Param::SetFloat(Param::InvStat2, selectedInverter2->GetInverterState());
  Param::SetFloat(Param::INVudc2, selectedInverter2->GetInverterVoltage());

  Param::SetInt(Param::T15Stat, selectedVehicle->Ready());

  // Needs to move to shunt handling
  int32_t IsaTemp = ISA::Temperature;
  Param::SetInt(Param::tmpaux, IsaTemp);
  // end need to move

  // Charge interface logic
  if (targetChgint == ChargeInterfaces::i3LIM ||
      targetChgint == ChargeInterfaces::Foccci || chargeModeDC)
    selectedChargeInt
        ->Task100Ms(); // send the 100ms task request for the lim all the time
                       // and for others if in DC charge mode

  if (selectedChargeInt->DCFCRequest(RunChg) ||
      ExtHVreq) // Request to run dc fast charge via charge interface or
                // external pin io
  {
    // Here we receive a valid DCFC startup request.
    if (opmode != MOD_RUN)
      chargeMode = true; // set charge mode to true to bring up hv
    chargeModeDC = true; // DC charge mode on
  } else if (chargeModeDC) {
    Param::SetInt(Param::chgtyp, OFF);
    chargeMode = false;   // no charge mode
    chargeModeDC = false; // DC charge mode off
  }

  if (!chargeModeDC) // Request to run ac charge from the interface (e.g. LIM)
                     // if we are NOT in DC charge mode.
  {
    ACrequest = selectedChargeInt->ACRequest(
        RunChg); // If using unused always returns true
  }
  // End charge interface logic

  // Reading HeatReq inpput
  if (IOMatrix::GetPin(IOMatrix::HEATREQ) !=
      &DigIo::dummypin) // digital input has priority, check if used
  {
    Param::SetInt(Param::HeatReq, IOMatrix::GetPin(IOMatrix::HEATREQ)->Get());
  } else if (Param::GetInt(Param::GPA1Func) == IOMatrix::HEATER_POT ||
             Param::GetInt(Param::GPA2Func) ==
                 IOMatrix::HEATER_POT) // check if Anolgue Heater input used
  {
    int htrPotVal = IOMatrix::GetAnaloguePin(IOMatrix::HEATER_POT)
                        ->Get(); // Get input value
    Param::SetInt(Param::HtPotVal, htrPotVal);

    if (Param::GetInt(Param::HeatPotDir) == 2 ||
        Param::GetInt(Param::HeatPotDir) ==
            3) // If higher then threshold is HEAT ON
    {

      if (htrPotVal >
          Param::GetInt(Param::HeatPotOn)) // if value is above threshold
      {
        if (Param::GetInt(Param::HeatPotDir) == 3)
          Param::SetInt(
              Param::HeatPercnt,
              utils::change(htrPotVal, Param::GetInt(Param::HeatPotOn),
                            Param::GetInt(Param::HeatPotFull), 0,
                            100));        // map threshold to 0 and full to 100
        Param::SetInt(Param::HeatReq, 1); // On
      } else {
        Param::SetInt(Param::HeatReq, 0); // Off
      }
    } else if (Param::GetInt(Param::HeatPotDir) == 0 ||
               Param::GetInt(Param::HeatPotDir) ==
                   1) // If higher then threshold is HEAT ON
    {
      if (htrPotVal <
          Param::GetInt(Param::HeatPotOn)) // if value is below threshold
      {
        if (Param::GetInt(Param::HeatPotDir) == 1)
          Param::SetInt(
              Param::HeatPercnt,
              utils::change(htrPotVal, Param::GetInt(Param::HeatPotOn),
                            Param::GetInt(Param::HeatPotFull), 0,
                            100));        // map threshold to 100 and full to 0
        Param::SetInt(Param::HeatReq, 1); // On
      } else {
        Param::SetInt(Param::HeatReq, 0); // Of
      }
    }
  }

  // Reading HVrequest inpput
  if (IOMatrix::GetPin(IOMatrix::HVREQ) != &DigIo::dummypin) {
    ExtHVreq = IOMatrix::GetPin(IOMatrix::HVREQ)
                   ->Get(); // Read IO pin to determine if there is an external
                            // HV request
    if (ExtHVreq)
      Param::SetInt(Param::chgtyp, DCEXT);
  }

  DigiPot::SetPot1Step(); // just for dev
  DigiPot::SetPot2Step(); // just for dev

  // Reading HVIL input
  if (IOMatrix::GetPin(IOMatrix::HVIL) != &DigIo::dummypin) {
    CheckHVIL = IOMatrix::GetPin(IOMatrix::HVIL)->Get();
    if (CheckHVIL > 0) {
      HVILok = 1;
    } else {
      HVILok = 0;
      ErrorMessage::Post(ERR_HVILERR);
    }
  } else {
    HVILok = 1;
  }

  // Cooling Fan Control//
  if (opmode == MOD_CHARGE || opmode == MOD_RUN) {
    float tempTemp =
        MAX(Param::GetFloat(Param::tmphs), Param::GetFloat(Param::ChgTemp));

