damienmaguire/Stm32-vcu/src/stm32_vcu.cpp
    if (Param::GetFloat(Param::FanTemp) < tempTemp) {
      IOMatrix::GetPin(IOMatrix::COOLINGFAN)->Set(); // Coolant Fan On
    } else if ((Param::GetFloat(Param::FanTemp) - 5) > tempTemp) {
      IOMatrix::GetPin(IOMatrix::COOLINGFAN)->Clear(); // Coolant Fan Off
    }
  } else {
    IOMatrix::GetPin(IOMatrix::COOLINGFAN)->Clear(); // Coolant Fan Off
  }

  // HV Active output
  if (opmode == MOD_CHARGE || opmode == MOD_RUN || opmode == MOD_PREHEAT) {
    IOMatrix::GetPin(IOMatrix::HVACTIVE)->Set(); // HV Active On
  } else {
    IOMatrix::GetPin(IOMatrix::HVACTIVE)->Clear(); // HV Active Off
  }

  // ShiftLock Out output
  if (opmode == MOD_RUN && Param::GetInt(Param::ShiftLock) == 1) {
    IOMatrix::GetPin(IOMatrix::SHIFTLOCKNO)->Set(); // Shift Lock Out On
  } else {
    IOMatrix::GetPin(IOMatrix::SHIFTLOCKNO)->Clear(); // Shift Lock Out Off
  }
}

static void ControlCabHeater(int opmode) {
  // Only run heater in run mode if enabled or timer set, also run is mode is
  // preheat What about charge mode and timer mode?
  if ((opmode == MOD_RUN && Param::GetInt(Param::Control) >= 1) ||
      opmode == MOD_PREHEAT) {
    // Heater enable and coolant pump on
    IOMatrix::GetPin(IOMatrix::HEATERENABLE)->Set();
    // TODO: Currently does nothing except on WebastoHVH
    selectedHeater->SetTargetTemperature(60);
    selectedHeater->SetPower(Param::GetInt(Param::HeatPwr),
                             Param::GetBool(Param::HeatReq));
  } else {
    IOMatrix::GetPin(IOMatrix::HEATERENABLE)
        ->Clear(); // Disable heater and coolant pump
    selectedHeater->SetPower(0, 0);
  }
}

static void Ms10Task(void) {
  static uint32_t vehicleStartTime = 0;

  int32_t previousSpeed = Param::GetInt(Param::speed);
  int32_t speed = 0;
  float torquePercent;
  int opmode = Param::GetInt(Param::opmode);
  int stt = STAT_NONE;
  int requestedDirection = Param::GetInt(Param::dir);
  int rollingDirection = 0;

  ErrorMessage::SetTime(rtc_get_counter_val());

  selectedChargeInt->Task10Ms();

  if (Param::GetInt(Param::opmode) == MOD_RUN) //!!!THROTTLE CODE HERE//
  {
    torquePercent = utils::ProcessThrottle(
        ABS(previousSpeed)); // run the throttle reading and checks and then
                             // generate Potnom

    // When requesting regen we need to be careful. If the car is not rolling
    // in the same direction as the selected gear, we will actually accelerate!
    // Exclude openinverter here because that has its own regen logic

    if (torquePercent < 0 &&
        Param::GetInt(Param::Inverter) != InvModes::OpenI) {
      if (Param::GetInt(Param::reversemotor) == 0) {
        rollingDirection = previousSpeed >= 0 ? 1 : -1;
      } else {
        rollingDirection = previousSpeed >= 0 ? -1 : 1;
      }
      // When rolling backward while in forward gear, apply POSITIVE torque to
      // slow down backward motion Vice versa when in reverse gear and rolling
      // forward.
      if (rollingDirection != requestedDirection) {
        torquePercent = -torquePercent;
      }
    }

    torquePercent *= requestedDirection; // torque requests invert when reverse
                                         // direction is selected

    selectedInverter->Task10Ms();
    selectedInverter2->Task10Ms();
  } else {
    torquePercent = 0;
    utils::displayThrottle(); // just displays pot and pot2 when not in run mode
                              // to allow throttle cal
  }

  selectedInverter->SetTorque(torquePercent);

  switch (Param::GetInt(Param::Inverter2UseCase)) {
  case Inv2UseCase::SecondDriveMotor:
    selectedInverter2->SetTorque(
        torquePercent * Param::GetFloat(Param::Inverter2TorqueRatio) / 100);
    break;
  case Inv2UseCase::PTOMotor:
    selectedInverter2->SetTorque(ptoControl.GetTorque(opmode));
    break;
  case Inv2UseCase::NotUsed:
  default:
    selectedInverter2->SetTorque(0);
    break;
  }

  if (Param::GetInt(Param::potnom) < Param::GetInt(Param::RegenBrakeLight)) {
    // enable Brake Light Ouput
    IOMatrix::GetPin(IOMatrix::BRAKELIGHT)->Set();
  } else {
    IOMatrix::GetPin(IOMatrix::BRAKELIGHT)->Clear();
  }

  // speed = ABS(selectedInverter->GetMotorSpeed());//set motor rpm on interface
  // NO ABS allowed on speed as we need to know direction
  speed = selectedInverter->GetMotorSpeed(); // set motor rpm on interface

  Param::SetInt(Param::speed, speed);
  // Telemetry only - not fed into rev counter/throttle/regen/cruise control,
  // which stay keyed to inverter1's speed until those get dual-motor support.
  Param::SetInt(Param::speed2, selectedInverter2->GetMotorSpeed());
  utils::GetDigInputs(canInterface[Param::GetInt(Param::InverterCan)]);

  if (opmode == MOD_RUN ||
      opmode == MOD_CHARGE) // only set rev counter when in RUN or CHARGE
  {
    selectedVehicle->SetRevCounter(
        ABS(speed)); // ABS allowed here to keep number from rolling over.
  }
  selectedVehicle->SetTemperatureGauge(Param::GetFloat(Param::tmphs));
  selectedVehicle->Task10Ms();
  selectedDCDC->Task10Ms();
  selectedShifter->Task10Ms();
  if (opmode == MOD_CHARGE) {
    selectedCharger->Task10Ms();
  } else if (Param::GetInt(Param::chargemodes) == ChargeModes::Leaf_PDM) {
    selectedCharger->Task10Ms();
  }
  if (opmode == MOD_RUN)
    Param::SetInt(Param::canctr,
                  (Param::GetInt(Param::canctr) + 1) &
                      0xF); // Update the OI can counter in RUN mode only
  if (opmode == MOD_RUN)
    selectedCompressor->Task10Ms();

  //////////////////////////////////////////////////
  //            MODE CONTROL SECTION              //
  //////////////////////////////////////////////////
  float udc = utils::ProcessUdc(speed);
  stt |= Param::GetInt(Param::pot) <= Param::GetInt(Param::potmin)
             ? STAT_NONE
             : STAT_POTPRESSED;
  stt |= udc >= Param::GetFloat(Param::udcsw) ? STAT_NONE : STAT_UDCBELOWUDCSW;
  stt |= udc < Param::GetFloat(Param::udclim) ? STAT_NONE : STAT_UDCLIM;
  Param::SetInt(Param::status, stt);

  switch (opmode) {
  case MOD_OFF:
    initbyStart = false;
    initbyCharge = false;
    preheater.SetInitByPreHeat(false);
    maintainer12V.SetInitByMaintainer(false);

