damienmaguire/Stm32-vcu/src/stm32_vcu.cpp
    DigIo::inv_out.Clear();                           // inverter power off
    IOMatrix::GetPin(IOMatrix::COOLANTPUMP)->Clear(); // Coolant pump off if
                                                      // used
    Param::SetInt(
        Param::dir,
        0); // shift to park/neutral on shutdown regardless of shifter pos
    selectedVehicle->DashOff();

    StartSig = false; // reset for next time

    if (rlyDly != 0) {
      rlyDly--; // here we are going to pause to allow system shut down before
                // opening HV contactors
      selectedCharger->Off(); // send message to charger to shut down
    }
    if (rlyDly == 0) {
      DigIo::dcsw_out.Clear();
      IOMatrix::GetPin(IOMatrix::NEGCONTACTOR)
          ->Clear(); // Negative contactors off if used
      DigIo::prec_out.Clear();
    }

    if (Param::GetInt(Param::pot) < Param::GetInt(Param::potmin)) {
      if (selectedVehicle->Start() && selectedVehicle->Ready() &&
          (HVILok > 0)) {
        StartSig = true;
        opmode = MOD_PRECHARGE; // proceed to precharge if 1)throttle not
                                // pressed , 2)ign on , 3)start signal rx, 4) HV
                                // IL input is grounded if selected.
        rlyDly = 25;            // Recharge sequence timer
        vehicleStartTime = rtc_get_counter_val();
        initbyStart = true;
      }
    }
    if (chargeMode) {
      opmode = MOD_PRECHARGE; // proceed to precharge if charge requested.
      rlyDly = 25;            // Recharge sequence timer
      vehicleStartTime = rtc_get_counter_val();
      initbyCharge = true;
    }
    if (preheater.GetRunPreHeat()) {
      opmode = MOD_PRECHARGE; // proceed to precharge if charge requested.
      rlyDly = 25;            // Recharge sequence timer
      vehicleStartTime = rtc_get_counter_val();
      preheater.SetInitByPreHeat(true);
    }
    if (maintainer12V.GetRunMaintainer()) {
      opmode = MOD_PRECHARGE; // proceed to precharge if charge requested.
      rlyDly = 25;            // Recharge sequence timer
      vehicleStartTime = rtc_get_counter_val();
      maintainer12V.SetInitByMaintainer(true);
    }
    Param::SetInt(Param::opmode, opmode);
    break;

  case MOD_PRECHARGE:
    if (!chargeMode) {
      if (selectedInverter != &openInv)
        DigIo::inv_out.Set(); // inverter power on but not if we are in charge
                              // mode and not if OI
    } else if ((Param::GetInt(Param::ShuntType) == 0) &&
               selectedInverter == &leafInv) // Shunt 0 + Leaf is precharge
                                             // using leaf inverter voltage
    {
      DigIo::inv_out.Set(); // inverter power on
    }
    IOMatrix::GetPin(IOMatrix::NEGCONTACTOR)->Set();
    IOMatrix::GetPin(IOMatrix::COOLANTPUMP)->Set();
    if (rlyDly != 0)
      rlyDly--; // here we are going to pause before energising precharge to
                // prevent too many contactors pulling amps at the same time
    if (rlyDly == 0)
      DigIo::prec_out.Set(); // commence precharge
    if (prechargeMinTime != 0)
      prechargeMinTime--; // 1 second minimum precharge time
    if ((prechargeMinTime == 0) &&
        (stt & (STAT_POTPRESSED | STAT_UDCBELOWUDCSW | STAT_UDCLIM)) ==
            0) // Clarify operator precedence, exit precharge: time met and no
               // faults
    {
      if (StartSig) {
        opmode = MOD_RUN;
        StartSig = false;                    // reset for next time
        rlyDly = 25;                         // Recharge sequence timer
        Param::SetInt(Param::TorqDerate, 0); // clear torque derate reason
      } else if (chargeMode) {
        opmode = MOD_CHARGE;
        rlyDly = 25;                         // Recharge sequence timer
        Param::SetInt(Param::TorqDerate, 0); // clear torque derate reason
      } else if (preheater.GetRunPreHeat()) {
        opmode = MOD_PREHEAT;
        rlyDly = 25;                         // Recharge sequence timer
        Param::SetInt(Param::TorqDerate, 0); // clear torque derate reason
      } else if (maintainer12V.GetRunMaintainer()) {
        opmode = MOD_MAINTAIN;
        rlyDly = 25;                         // Recharge sequence timer
        Param::SetInt(Param::TorqDerate, 0); // clear torque derate reason
        Param::SetInt(Param::maintainWakeups,
                      Param::GetInt(Param::maintainWakeups) + 1);
      }
    }
    if (initbyCharge && !chargeMode)
      opmode = MOD_OFF; // These two statements catch a precharge hang from
                        // either start mode or run mode.
    if (initbyStart && !selectedVehicle->Ready())
      opmode = MOD_OFF;
    if (preheater.GetInitByPreHeat() && !preheater.GetRunPreHeat())
      opmode = MOD_OFF;
    if (maintainer12V.GetInitByMaintainer() &&
        !maintainer12V.GetRunMaintainer())
      opmode = MOD_OFF;

    if (udc < (Param::GetInt(Param::udcsw)) &&
        rtc_get_counter_val() > (vehicleStartTime + PRECHARGE_TIMEOUT)) {
      DigIo::prec_out.Clear();
      ErrorMessage::Post(ERR_PRECHARGE);
      opmode = MOD_PCHFAIL;
    }
    Param::SetInt(Param::opmode, opmode);
    break;

  case MOD_PCHFAIL:
    StartSig = false;
    DigIo::prec_out
        .Clear(); // explicitly turn off precharge relay in a fail condition
    if (initbyCharge && !chargeMode)
      opmode = MOD_OFF; // only go to off if the signal from charge or vehicle
                        // start is removed
    if (initbyStart && !selectedVehicle->Ready())
      opmode = MOD_OFF; // this avoids oscillation in the event of a precharge
                        // system failure
    Param::SetInt(Param::opmode, opmode);
    break;

  case MOD_CHARGE:
    if (rlyDly != 0)
      rlyDly--; // here we are going to pause before energising precharge to
                // prevent too many contactors pulling amps at the same time
    if (rlyDly == 0) {
      DigIo::dcsw_out.Set();
    }
    ErrorMessage::UnpostAll();
    if (!chargeMode) {
      opmode = MOD_OFF;
      rlyDly = 250; // Recharge sequence timer for delayed shutdown
    }
    Param::SetInt(Param::opmode, opmode);
    break;

  case MOD_RUN:
    if (rlyDly != 0)
      rlyDly--; // here we are going to pause before energising precharge to
                // prevent too many contactors pulling amps at the same time
    if (rlyDly == 0) {
      DigIo::dcsw_out.Set();
      DigIo::inv_out.Set(); // inverter power on
    }
    Param::SetInt(Param::opmode, MOD_RUN);
    ErrorMessage::UnpostAll();
    if (!selectedVehicle->Ready()) {
      opmode = MOD_OFF;
      rlyDly = 250; // Recharge sequence timer for delayed shutdown
    }
    Param::SetInt(Param::opmode, opmode);
    break;

  case MOD_MAINTAIN:
    if (rlyDly != 0)
      rlyDly--; // here we are going to pause before energising precharge to
                // prevent too many contactors pulling amps at the same time
    if (rlyDly == 0) {
      DigIo::dcsw_out.Set();
    }

    maintainer12V.Ms10Task();

    if (!maintainer12V.GetRunMaintainer()) {
      rlyDly = 250; // Recharge sequence timer for delayed shutdown
    }

    if ((selectedVehicle->Start() && selectedVehicle->Ready())) {
      maintainer12V.CancelMaintainer();
    }

    break;

  case MOD_PREHEAT:
    if (rlyDly != 0)
      rlyDly--; // here we are going to pause before energising precharge to
                // prevent too many contactors pulling amps at the same time
    if (rlyDly == 0) {
      DigIo::dcsw_out.Set();
    }

