damienmaguire/Stm32-vcu/src/stm32_vcu.cpp
    preheater.Ms10Task();

    if (!preheater.GetRunPreHeat()) {
      rlyDly = 250; // Recharge sequence timer for delayed shutdown
    }
    break;
  }

  ControlCabHeater(opmode);
  if (Param::GetInt(Param::ShuntType) == 2)
    SBOX::ControlContactors(
        opmode,
        canInterface[Param::GetInt(Param::ShuntCan)]); // BMW contactor box
  if (Param::GetInt(Param::ShuntType) == 3)
    VWBOX::ControlContactors(
        opmode,
        canInterface[Param::GetInt(Param::ShuntCan)]); // VW contactor box
}

static void Ms1Task(void) {
  selectedInverter->Task1Ms();
  selectedInverter2->Task1Ms();
  selectedVehicle->Task1Ms();
  selectedCharger->Task1Ms();
  selectedChargeInt->Task1Ms();
  selectedShifter->Task1Ms();
  selectedDCDC->Task1Ms();
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static void UpdateInv() {
  selectedInverter->DeInit();
  switch (Param::GetInt(Param::Inverter)) {
  case InvModes::NoInv:
    selectedInverter = &UnUsed;
    break;
  case InvModes::Leaf_Gen1:
    selectedInverter = &leafInv;
    break;
  case InvModes::GS450H:
    selectedInverter = &gs450Inverter;
    gs450Inverter.SetGS450H();
    break;
  case InvModes::GS300H:
    selectedInverter = &gs450Inverter;
    gs450Inverter.SetGS300H();
    break;
  case InvModes::Prius_Gen3:
    selectedInverter = &gs450Inverter;
    gs450Inverter.SetPrius();
    break;
  case InvModes::Outlander:
    selectedInverter = &outlanderInv;
    OutlanderCAN = true;
    break;
  case InvModes::OpenI:
    selectedInverter = &openInv;
    break;
  case InvModes::RearOutlander:
    selectedInverter = &rearoutlanderInv;
    OutlanderCAN = true;
    break;
  case InvModes::ACPropulsion:
    selectedInverter = &inverterAcp;
    break;
  case InvModes::VescController:
    selectedInverter = &inverterVESC;
    break;
  }
  // This will call SetCanFilters() via the Clear Callback
  canInterface[0]->ClearUserMessages();
  canInterface[1]->ClearUserMessages();
}

static void UpdateVehicle() {
  switch (Param::GetInt(Param::Vehicle)) {
  case vehicles::None:
    selectedVehicle = &UnUsed;
    break;
  case vehicles::vBMW_E39:
    selectedVehicle = &e39Vehicle;
    e39Vehicle.SetE46(false);
    break;
  case vehicles::vBMW_E46:
    selectedVehicle = &e39Vehicle;
    e39Vehicle.SetE46(true);
    break;
  case vehicles::vBMW_E65:
    selectedVehicle = &e65Vehicle;
    break;
  case vehicles::vVAG:
    selectedVehicle = &vagVehicle;
    break;
  case vehicles::vSUBARU:
    selectedVehicle = &subaruVehicle;
    break;
  case vehicles::vBMW_E31:
    selectedVehicle = &e31Vehicle;
    break;
  case vehicles::Classic:
    selectedVehicle = &classVehicle;
    break;
  }
  // This will call SetCanFilters() via the Clear Callback
  canInterface[0]->ClearUserMessages();
  canInterface[1]->ClearUserMessages();
}

static void UpdateCharger() {
  selectedCharger->DeInit();
  switch (Param::GetInt(Param::chargemodes)) {
  case ChargeModes::Off:
    chargeMode = false;
    selectedCharger = &UnUsed;
    break;
  case ChargeModes::EXT_DIGI:
    selectedCharger = &chgdigi;
    break;
  case ChargeModes::Volt_Ampera:
    selectedCharger = &ampChg;
    break;
  case ChargeModes::Leaf_PDM:
    selectedCharger = &chargerPDM;
    break;
  case ChargeModes::TeslaOI:
    selectedCharger = &ChargerTesla;
    break;
  case ChargeModes::Out_lander:
    selectedCharger = &outChg;
    OutlanderCAN = true;
    break;
  case ChargeModes::Elcon:
    selectedCharger = &ChargerElcon;
    break;
  case ChargeModes::MGgen2:
    selectedCharger = &MGgen2v2l;
    break;
  }
  // This will call SetCanFilters() via the Clear Callback
  canInterface[0]->ClearUserMessages();
  canInterface[1]->ClearUserMessages();
}

static void UpdateChargeInt() {
  selectedChargeInt->DeInit();
  switch (Param::GetInt(Param::interface)) {
  case ChargeInterfaces::Unused:
    selectedChargeInt = &UnUsed;
    break;
  case ChargeInterfaces::Chademo:
    selectedChargeInt = &chademoFC;
    break;
  case ChargeInterfaces::i3LIM:
    selectedChargeInt = &LIMFC;
    break;
  case ChargeInterfaces::CPC:
    selectedChargeInt = &CPCcan;
    break;
  case ChargeInterfaces::Foccci:
    selectedChargeInt = &Focccican;
    break;
  }
  // This will call SetCanFilters() via the Clear Callback
  canInterface[0]->ClearUserMessages();
  canInterface[1]->ClearUserMessages();
}

static void UpdateHeater() {
  selectedHeater->DeInit();
  switch (Param::GetInt(Param::Heater)) {
  case HeatType::Noheater:
    selectedHeater = &UnUsed;
    break;
  case HeatType::AmpHeater:
    selectedHeater = &amperaHeater;
    break;
  case HeatType::VWCoolant:
    selectedHeater = &heaterCoolantVW;
    heaterCoolantVW.SetLinInterface(lin);
    break;
  case HeatType::VWAir:
    selectedHeater = &heaterAirVW;
    heaterAirVW.SetLinInterface(lin);
    break;
  case HeatType::MGCoolant:
    selectedHeater = &heaterCoolantMG;
    break;
  case HeatType::OutlanderHeater:
    selectedHeater = &outlanderCanHeater;
    OutlanderCAN = true;
    break;
  case HeatType::PWM:
    selectedHeater = &pwmHeater;
    break;
  case HeatType::HVH50:
    selectedHeater = &webastoHeater;
    webastoHeater.SetLinInterface(lin);
    webastoHeater.SetSubtype(WebastoHVH::HVH50);
    break;
  case HeatType::HVH100:
    selectedHeater = &webastoHeater;
    webastoHeater.SetLinInterface(lin);
    webastoHeater.SetSubtype(WebastoHVH::HVH100);
    break;
  }
  // This will call SetCanFilters() via the Clear Callback
  canInterface[0]->ClearUserMessages();
  canInterface[1]->ClearUserMessages();
}

static void UpdateBMS() {
  selectedBMS->DeInit();
  switch (Param::GetInt(Param::BMS_Mode)) {
  case BMSModes::BMSModeSimpBMS:
    selectedBMS = &BMSsimp;
    break;
  case BMSModes::BMSModeLeafBMS:
    selectedBMS = &BMSleaf;
    break;
  case BMSModes::BMSModeDaisychainSingleBMS:
  case BMSModes::BMSModeDaisychainDualBMS:
    selectedBMS = &BMSdaisychain;
    break;
  case BMSModes::BMSRenaultKangoo33BMS:
    selectedBMS = &BMSRenaultKangoo33;
    break;
  case BMSModes::BMSSTW:
    selectedBMS = &stwBms;
    break;
  case BMSModes::BMSOIFlyingAdc:
    selectedBMS = &flyingAdcBms;
    break;
  default:
    // Default to no BMS
    selectedBMS = &UnUsed;
    break;
  }
  // This will call SetCanFilters() via the Clear Callback
  canInterface[0]->ClearUserMessages();
  canInterface[1]->ClearUserMessages();
}

