damienmaguire/Stm32-vcu/src/stm32_vcu.cpp
static void UpdateDCDC() {
  selectedDCDC->DeInit();
  switch (Param::GetInt(Param::DCdc_Type)) {
  case DCDCModes::NoDCDC:
    selectedDCDC = &DCDCnone;
    break;

  case DCDCModes::TeslaG2:
    selectedDCDC = &DCDCTesla;
    break;

  case DCDCModes::DCDCElcon:
    selectedDCDC = &ElconDC;
    break;

  default:
    // Default to no DCDC
    selectedDCDC = &DCDCnone;
    break;
  }
  // This will call SetCanFilters() via the Clear Callback
  canInterface[0]->ClearUserMessages();
  canInterface[1]->ClearUserMessages();
}

static void UpdateCompressor() {
  switch (Param::GetInt(Param::Compressor)) {
  case CompressorOptions::NoCompress:
    selectedCompressor = &UnUsed;
    break;
  case CompressorOptions::OutlanderCompress:
    selectedCompressor = &outlanderCompressor;
    OutlanderCAN = true;
    break;
  }

  // This will call SetCanFilters() via the Clear Callback
  canInterface[0]->ClearUserMessages();
  canInterface[1]->ClearUserMessages();
}

static void UpdateShifter() {

  switch (Param::GetInt(Param::GearLvr)) {
  case ShifterModes::NoShifter:
    selectedShifter = &shifterNone;
    break;

  case ShifterModes::BMWF30:
    selectedShifter = &F30GearLever;
    break;

  case ShifterModes::JLRG1:
    selectedShifter = &JLRG1shift;
    break;

  case ShifterModes::JLRG2:
    selectedShifter = &JLRG2shift;
    break;

  case ShifterModes::BMWE65:
    selectedShifter = &E65GearLever;
    break;

  default:
    // Default to no shifter
    selectedShifter = &shifterNone;
    break;
  }
  // This will call SetCanFilters() via the Clear Callback
  canInterface[0]->ClearUserMessages();
  canInterface[1]->ClearUserMessages();
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static void UpdateInv2() {
  selectedInverter2->DeInit();
  switch (Param::GetInt(Param::Inverter2)) {
  case InvModes::NoInv:
    selectedInverter2 = &UnUsed;
    break;
  case InvModes::Leaf_Gen1:
    selectedInverter2 = &leafInv2;
    break;
  case InvModes::OpenI:
    selectedInverter2 = &openInv2;
    break;
  case InvModes::Outlander:
    selectedInverter2 = &outlanderInv2;
    OutlanderCAN = true;
    break;
  case InvModes::RearOutlander:
    selectedInverter2 = &rearoutlanderInv2;
    OutlanderCAN = true;
    break;
  case InvModes::ACPropulsion:
    selectedInverter2 = &inverterAcp2;
    break;
  case InvModes::VescController:
    selectedInverter2 = &inverterVESC2;
    break;
  default:
    selectedInverter2 = &UnUsed;
    break;
  }
  selectedInverter2->SetTorqueParam(Param::torque2);
  selectedInverter2->SetReverseParam(Param::reversemotor2);
  // This will call SetCanFilters() via the Clear Callback
  canInterface[0]->ClearUserMessages();
  canInterface[1]->ClearUserMessages();
}

// Whenever the user clears mapped can messages or changes the
// CAN interface of a device, this will be called by the CanHardware module
static void SetCanFilters() {
  CanHardware *inverter_can = canInterface[Param::GetInt(Param::InverterCan)];
  CanHardware *inverter2_can = canInterface[Param::GetInt(Param::Inverter2Can)];
  CanHardware *vehicle_can = canInterface[Param::GetInt(Param::VehicleCan)];
  CanHardware *shunt_can = canInterface[Param::GetInt(Param::ShuntCan)];
  CanHardware *lim_can = canInterface[Param::GetInt(Param::LimCan)];
  CanHardware *charger_can = canInterface[Param::GetInt(Param::ChargerCan)];
  CanHardware *bms_can = canInterface[Param::GetInt(Param::BMSCan)];
  CanHardware *obd2_can = canInterface[Param::GetInt(Param::OBD2Can)];
  CanHardware *dcdc_can = canInterface[Param::GetInt(Param::DCDCCan)];
  CanHardware *heater_can = canInterface[Param::GetInt(Param::HeaterCan)];
  CanHardware *compressor_can =
      canInterface[Param::GetInt(Param::CompressorCan)];

  selectedInverter->SetCanInterface(inverter_can);
  selectedInverter2->SetCanInterface(inverter2_can);
  selectedVehicle->SetCanInterface(vehicle_can);
  selectedCharger->SetCanInterface(charger_can);
  selectedChargeInt->SetCanInterface(lim_can);
  selectedBMS->SetCanInterface(bms_can);
  selectedDCDC->SetCanInterface(dcdc_can);
  selectedShifter->SetCanInterface(vehicle_can);
  canOBD2.SetCanInterface(obd2_can);
  selectedHeater->SetCanInterface(heater_can);
  selectedCompressor->SetCanInterface(compressor_can);

  if (Param::GetInt(Param::ShuntType) == 1 ||
      Param::GetInt(Param::ShuntType) == 4)
    ISA::RegisterCanMessages(shunt_can); // select isa shunt
  if (Param::GetInt(Param::ShuntType) == 2)
    SBOX::RegisterCanMessages(shunt_can); // select bmw sbox
  if (Param::GetInt(Param::ShuntType) == 3)
    VWBOX::RegisterCanMessages(shunt_can); // select vw sbox

  canInterface[1]->RegisterUserMessage(0x601); // CanSDO
  canInterface[0]->RegisterUserMessage(0x601); // CanSDO
}

void Param::Change(Param::PARAM_NUM paramNum) {
  // This function is called when the user changes a parameter
  switch (paramNum) {
  case Param::Inverter:
    UpdateInv();
    break;
  case Param::Inverter2:
    UpdateInv2();
    break;
  case Param::Vehicle:
    UpdateVehicle();
    break;
  case Param::chargemodes:
    UpdateCharger();
    break;
  case Param::interface:
    UpdateChargeInt();
    break;
  case Param::Heater:
    UpdateHeater();
    break;
  case Param::BMS_Mode:
    UpdateBMS();
    break;
  case Param::Compressor:
    UpdateCompressor();
    break;
  case Param::DCdc_Type:
    UpdateDCDC();
    break;
  case Param::GearLvr:
    UpdateShifter();
    break;
  case Param::InverterCan:
  case Param::Inverter2Can:
  case Param::VehicleCan:
  case Param::ShuntCan:
  case Param::LimCan:
  case Param::ChargerCan:
  case Param::CompressorCan:
    canInterface[0]->ClearUserMessages();
    canInterface[1]->ClearUserMessages();
    break;
  case Param::CAN3Speed:
    CANSPI_Initialize(); // init the MCP25625 on CAN3
    CANSPI_ENRx_IRQ();   // init CAN3 Rx IRQ
    break;
  case Param::Tim3_Presc:
  case Param::Tim3_Period:
  case Param::Tim3_1_OC:
  case Param::Tim3_2_OC:
  case Param::Tim3_3_OC:
  case Param::PWM1Func:
  case Param::PWM2Func:
  case Param::PWM3Func:
    tim3_setup();
    break;
  case Param::CP_PWM:
    // timer_set_oc_value(TIM3, TIM_OC3,
    // (Param::GetInt(Param::CP_PWM)*66)-16);//No duty set here
    break;
  default:
    break;
  }

  if (Param::GetInt(Param::reversemotor) != 0) {
    if (Param::GetInt(Param::Inverter) == InvModes::RearOutlander) {

    } else {
      Param::SetInt(Param::reversemotor, 0);
    }
  }

