damienmaguire/Stm32-vcu/src/stm32_vcu.cpp
  if (Param::GetInt(Param::reversemotor2) != 0) {
    if (Param::GetInt(Param::Inverter2) == InvModes::RearOutlander) {

    } else {
      Param::SetInt(Param::reversemotor2, 0);
    }
  }

  Throttle::potmin[0] = Param::GetInt(Param::potmin);
  Throttle::potmax[0] = Param::GetInt(Param::potmax);
  Throttle::potmin[1] = Param::GetInt(Param::pot2min);
  Throttle::potmax[1] = Param::GetInt(Param::pot2max);
  Throttle::regenRpm = Param::GetFloat(Param::regenrpm);
  Throttle::regenendRpm = Param::GetFloat(Param::regenendrpm);
  Throttle::ThrotRpmFilt = Param::GetFloat(Param::throtrpmfilt);
  if (Throttle::regenRpm < Throttle::regenendRpm) {
    Throttle::regenRpm = 1500;
    Throttle::regenendRpm = 100;
    Param::SetFloat(Param::regenrpm, 1500);
    Param::SetFloat(Param::regenendrpm, 100);
  }
  Throttle::regenmax = Param::GetFloat(Param::regenmax);
  Throttle::throtmax = Param::GetFloat(Param::throtmax);
  Throttle::throtmin = Param::GetFloat(Param::throtmin);
  Throttle::throtdead = Param::GetFloat(Param::throtdead);
  // Throttle::idcmin = Param::GetFloat(Param::idcmin); //Make them dynamic so
  // code section can impact Throttle::idcmax = Param::GetFloat(Param::idcmax);
  // Throttle::udcmin = Param::GetFloat(Param::udcmin);
  // Throttle::udcmax = Param::GetFloat(Param::udclim);
  Throttle::speedLimit = Param::GetInt(Param::rpmlim);
  Throttle::regenRamp = Param::GetFloat(Param::regenramp);
  Throttle::throttleRamp = Param::GetFloat(Param::throtramp);
  Throttle::throtmaxRev = Param::GetFloat(throtmaxRev);
  Throttle::regenBrake = Param::GetFloat(Param::regenBrake);

  targetCharger = static_cast<ChargeModes>(
      Param::GetInt(Param::chargemodes)); // get charger setting from menu
  targetChgint = static_cast<ChargeInterfaces>(
      Param::GetInt(Param::interface)); // get interface setting from menu
  if (ChgSet == 1) {
    seconds = Param::GetInt(Param::Set_Sec); // only update these params if
                                             // charge command is set to disable
    minutes = Param::GetInt(Param::Set_Min);
    hours = Param::GetInt(Param::Set_Hour);
    days = Param::GetInt(Param::Set_Day);
    ChgHrs_tmp = GetInt(Param::Chg_Hrs);
    ChgMins_tmp = GetInt(Param::Chg_Min);
    ChgDur_tmp = GetInt(Param::Chg_Dur);
  }
  ChgSet = Param::GetInt(Param::Chgctrl); // 0=enable,1=disable,2=timer.
  ChgTicks =
      (GetInt(Param::Chg_Dur) *
       300); // number of 200ms ticks that equates to charge timer in minutes
  IOMatrix::AssignFromParams();
  IOMatrix::AssignFromParamsAnalogue();

  maintainer12V.ParamsChange();
  preheater.ParamsChange();
}

static bool CanCallback(uint32_t id, uint32_t data[2], uint8_t dlc,
                        CanHardware *bus) // This is where we go when a defined
                                          // CAN message is received.
{
  dlc = dlc;
  switch (id) {
  case 0x7DF:
    canOBD2.DecodeCAN(id, data);
    break;

  default:
    if (Param::GetInt(Param::ShuntType) == 1 ||
        Param::GetInt(Param::ShuntType) == 4)
      ISA::DecodeCAN(id, data);
    if (Param::GetInt(Param::ShuntType) == 2)
      SBOX::DecodeCAN(id, data);
    if (Param::GetInt(Param::ShuntType) == 3)
      VWBOX::DecodeCAN(id, data);
    // Inverter dispatch is bus-scoped: two simultaneously active inverter
    // instances of the same model use identical CAN IDs, so only the
    // instance actually configured for the bus this frame arrived on may
    // decode it - otherwise both instances would blindly accept both
    // buses' traffic.
    if (bus == canInterface[Param::GetInt(Param::InverterCan)])
      selectedInverter->DecodeCAN(id, data);
    if (bus == canInterface[Param::GetInt(Param::Inverter2Can)])
      selectedInverter2->DecodeCAN(id, data);
    selectedVehicle->DecodeCAN(id, data);
    selectedCharger->DecodeCAN(id, data);
    selectedChargeInt->DecodeCAN(id, data);
    selectedBMS->DecodeCAN(id, (uint8_t *)data);
    selectedDCDC->DecodeCAN(id, (uint8_t *)data);
    selectedShifter->DecodeCAN(id, data);
    selectedHeater->DecodeCAN(id, data);
    selectedCompressor->DecodeCAN(id, data);
    break;
  }
  return false;
}

static bool CanCallback1(uint32_t id, uint32_t data[2], uint8_t dlc) {
  return CanCallback(id, data, dlc, canInterface[0]);
}

static bool CanCallback2(uint32_t id, uint32_t data[2], uint8_t dlc) {
  return CanCallback(id, data, dlc, canInterface[1]);
}

static void ConfigureVariantIO() {
  ANA_IN_CONFIGURE(ANA_IN_LIST);
  DIG_IO_CONFIGURE(DIG_IO_LIST);

  AnaIn::Start();
}

extern "C" void tim4_isr(void) { scheduler->Run(); }

extern "C" void exti15_10_isr(void) // CAN3 MCP25625 interruppt
{
  uCAN_MSG rxMessage;
  uint32_t canData[2];
  if (CANSPI_receive(&rxMessage)) {
    canData[0] = (rxMessage.frame.data0 | rxMessage.frame.data1 << 8 |
                  rxMessage.frame.data2 << 16 | rxMessage.frame.data3 << 24);
    canData[1] = (rxMessage.frame.data4 | rxMessage.frame.data5 << 8 |
                  rxMessage.frame.data6 << 16 | rxMessage.frame.data7 << 24);
  }
  // can cast this to uint32_t[2]. dont be an idiot! * pointer
  CANSPI_CLR_IRQ();           // Clear Rx irqs in mcp25625
  exti_reset_request(EXTI15); // clear irq
  if ((rxMessage.frame.id == 0x108) || (rxMessage.frame.id == 0x109))
    selectedChargeInt->DecodeCAN(rxMessage.frame.id, canData);
}

extern "C" void rtc_isr(void) {
  /* The interrupt flag isn't cleared by hardware, we have to do it. */
  rtc_clear_flag(RTC_SEC);

  if (++seconds >= 60) {
    ++minutes;
    seconds -= 60;
  }
  if (minutes >= 60) {
    ++hours;
    minutes -= 60;
  }
  if (hours >= 24) {
    ++days;
    hours -= 24;
  }
}

int main(void) {
  extern const TERM_CMD TermCmds[];

  clock_setup();
  rtc_setup();
  ConfigureVariantIO();
  gpio_primary_remap(AFIO_MAPR_SWJ_CFG_JTAG_OFF_SW_ON,
                     AFIO_MAPR_CAN2_REMAP |
                         AFIO_MAPR_TIM1_REMAP_FULL_REMAP); // 32f107
  usart2_setup(); // TOYOTA HYBRID INVERTER INTERFACE
  nvic_setup();
  parm_load();
  spi2_setup();
  spi3_setup();
  tim3_setup(); // For general purpose PWM output
  Param::Change(Param::PARAM_LAST);
  DigIo::inv_out.Clear(); // inverter power off during bootup
  DigIo::mcp_sby.Clear(); // enable can3

  Terminal t(USART3, TermCmds, false, true, !Param::GetBool(Param::UseRS232));
  //   FunctionPointerCallback canCb(CanCallback, SetCanFilters);
  Stm32Can c(CAN1, CanHardware::Baud500);
  Stm32Can c2(CAN2, CanHardware::Baud500, true);
  FunctionPointerCallback cb1(CanCallback1, SetCanFilters);
  FunctionPointerCallback cb2(CanCallback2, SetCanFilters);
  Stm32Can *CanMapDev = &c;
  if (Param::GetInt(Param::CanMapCan) == 0) {
    CanMapDev = &c;
  } else {
    CanMapDev = &c2;
  }
  CanMap cm(CanMapDev);
  CanSdo sdo(&c, &cm);
  sdo.SetNodeId(3); // id 3 for vcu?
  // Set up CAN 1 callback and messages to listen for
  //  c.AddReceiveCallback(&canCb);
  //  c2.AddReceiveCallback(&canCb);
  canInterface[0] = &c;
  canInterface[1] = &c2;
  c.AddCallback(&cb1);
  c2.AddCallback(&cb2);
  TerminalCommands::SetCanMap(&cm);
  SdoCommands::SetCanMap(&cm);
  canMap = &cm;
  canSdo = &sdo;

  CanHardware *shunt_can = canInterface[Param::GetInt(Param::ShuntCan)];

  canOBD2.SetCanInterface(canInterface[Param::GetInt(Param::OBD2Can)]);

  CANSPI_Initialize(); // init the MCP25625 on CAN3
  CANSPI_ENRx_IRQ();   // init CAN3 Rx IRQ

  LinBus l(USART1, 19200);
  lin = &l;

  UpdateInv();
  UpdateInv2();
  UpdateVehicle();
  UpdateCharger();
  UpdateChargeInt();
  UpdateBMS();
  UpdateHeater();
  UpdateDCDC();
  UpdateShifter();
  UpdateCompressor();

  Stm32Scheduler s(TIM4); // We never exit main so it's ok to put it on stack
  scheduler = &s;

  s.AddTask(Ms1Task, 1);
  s.AddTask(Ms10Task, 10);
  s.AddTask(Ms100Task, 100);
  s.AddTask(Ms200Task, 200);

  if (Param::GetInt(Param::IsaInit) == 1)
    ISA::initialize(shunt_can); // only call this once if a new sensor is
                                // fitted.

  Param::SetInt(Param::version, 4);      // backward compatibility
  Param::SetInt(Param::opmode, MOD_OFF); // always off at startup

  while (1) {
    char c = 0;
    t.Run();
    if (sdo.GetPrintRequest() == PRINT_JSON) {
      TerminalCommands::PrintParamsJson(&sdo, &c);
    }
  }

  return 0;
}
